      ******************************************************************
      * Author: Alpakita
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ProgramationCobol.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 Numero PIC 99V99 VALUE 10.44.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY Numero
           DISPLAY "Cobol para Angelito :3"
           STOP RUN.
       END PROGRAM ProgramationCobol.
